BsAtHome/atpack/Atmel.ATtiny_DFP.atpack/edc/ATtiny417.PIC
        <edc:SFRDef edc:_addr="0x19A" edc:access="nnnnnnnn" edc:cname="ASYNCUSER8" edc:mclr="00000000" edc:nzwidth="0x8" edc:por="00000000" ltx:memberofperipheral="EVSYS">
          <edc:SFRModeList>
            <edc:SFRMode edc:id="DS.0" ltx:memberofperipheral="EVSYS">
              <edc:SFRFieldDef edc:cname="ASYNCUSER8" edc:desc="Asynchronous User Ch 8 Input Selection - Event Out 0" edc:nzwidth="0x8">
                <edc:SFRFieldSemantic edc:cname="OFF" edc:desc="Off" edc:when="(field &amp; 0xFF) == 0x00"/>
                <edc:SFRFieldSemantic edc:cname="SYNCCH0" edc:desc="Synchronous Event Channel 0" edc:when="(field &amp; 0xFF) == 0x01"/>
                <edc:SFRFieldSemantic edc:cname="SYNCCH1" edc:desc="Synchronous Event Channel 1" edc:when="(field &amp; 0xFF) == 0x02"/>
                <edc:SFRFieldSemantic edc:cname="ASYNCCH0" edc:desc="Asynchronous Event Channel 0" edc:when="(field &amp; 0xFF) == 0x03"/>
                <edc:SFRFieldSemantic edc:cname="ASYNCCH1" edc:desc="Asynchronous Event Channel 1" edc:when="(field &amp; 0xFF) == 0x04"/>
                <edc:SFRFieldSemantic edc:cname="ASYNCCH2" edc:desc="Asynchronous Event Channel 2" edc:when="(field &amp; 0xFF) == 0x05"/>
                <edc:SFRFieldSemantic edc:cname="ASYNCCH3" edc:desc="Asynchronous Event Channel 3" edc:when="(field &amp; 0xFF) == 0x06"/>
              </edc:SFRFieldDef>
            </edc:SFRMode>
          </edc:SFRModeList>
        </edc:SFRDef>
        <edc:SFRDef edc:_addr="0x19B" edc:access="nnnnnnnn" edc:cname="ASYNCUSER9" edc:mclr="00000000" edc:nzwidth="0x8" edc:por="00000000" ltx:memberofperipheral="EVSYS">
          <edc:SFRModeList>
            <edc:SFRMode edc:id="DS.0" ltx:memberofperipheral="EVSYS">
              <edc:SFRFieldDef edc:cname="ASYNCUSER9" edc:desc="Asynchronous User Ch 9 Input Selection - Event Out 1" edc:nzwidth="0x8">
                <edc:SFRFieldSemantic edc:cname="OFF" edc:desc="Off" edc:when="(field &amp; 0xFF) == 0x00"/>
                <edc:SFRFieldSemantic edc:cname="SYNCCH0" edc:desc="Synchronous Event Channel 0" edc:when="(field &amp; 0xFF) == 0x01"/>
                <edc:SFRFieldSemantic edc:cname="SYNCCH1" edc:desc="Synchronous Event Channel 1" edc:when="(field &amp; 0xFF) == 0x02"/>
                <edc:SFRFieldSemantic edc:cname="ASYNCCH0" edc:desc="Asynchronous Event Channel 0" edc:when="(field &amp; 0xFF) == 0x03"/>
                <edc:SFRFieldSemantic edc:cname="ASYNCCH1" edc:desc="Asynchronous Event Channel 1" edc:when="(field &amp; 0xFF) == 0x04"/>
                <edc:SFRFieldSemantic edc:cname="ASYNCCH2" edc:desc="Asynchronous Event Channel 2" edc:when="(field &amp; 0xFF) == 0x05"/>
                <edc:SFRFieldSemantic edc:cname="ASYNCCH3" edc:desc="Asynchronous Event Channel 3" edc:when="(field &amp; 0xFF) == 0x06"/>
              </edc:SFRFieldDef>
            </edc:SFRMode>
          </edc:SFRModeList>
        </edc:SFRDef>
        <edc:SFRDef edc:_addr="0x19C" edc:access="nnnnnnnn" edc:cname="ASYNCUSER10" edc:mclr="00000000" edc:nzwidth="0x8" edc:por="00000000" ltx:memberofperipheral="EVSYS">
          <edc:SFRModeList>
            <edc:SFRMode edc:id="DS.0" ltx:memberofperipheral="EVSYS">
              <edc:SFRFieldDef edc:cname="ASYNCUSER10" edc:desc="Asynchronous User Ch 10 Input Selection - Event Out 2" edc:nzwidth="0x8">
                <edc:SFRFieldSemantic edc:cname="OFF" edc:desc="Off" edc:when="(field &amp; 0xFF) == 0x00"/>
                <edc:SFRFieldSemantic edc:cname="SYNCCH0" edc:desc="Synchronous Event Channel 0" edc:when="(field &amp; 0xFF) == 0x01"/>
                <edc:SFRFieldSemantic edc:cname="SYNCCH1" edc:desc="Synchronous Event Channel 1" edc:when="(field &amp; 0xFF) == 0x02"/>
                <edc:SFRFieldSemantic edc:cname="ASYNCCH0" edc:desc="Asynchronous Event Channel 0" edc:when="(field &amp; 0xFF) == 0x03"/>
                <edc:SFRFieldSemantic edc:cname="ASYNCCH1" edc:desc="Asynchronous Event Channel 1" edc:when="(field &amp; 0xFF) == 0x04"/>
                <edc:SFRFieldSemantic edc:cname="ASYNCCH2" edc:desc="Asynchronous Event Channel 2" edc:when="(field &amp; 0xFF) == 0x05"/>
                <edc:SFRFieldSemantic edc:cname="ASYNCCH3" edc:desc="Asynchronous Event Channel 3" edc:when="(field &amp; 0xFF) == 0x06"/>
              </edc:SFRFieldDef>
            </edc:SFRMode>
          </edc:SFRModeList>
        </edc:SFRDef>
        <edc:AdjustPoint edc:_addr="0x19D" edc:offset="0x5"/>
        <edc:SFRDef edc:_addr="0x1A2" edc:access="nnnnnnnn" edc:cname="SYNCUSER0" edc:mclr="00000000" edc:nzwidth="0x8" edc:por="00000000" ltx:memberofperipheral="EVSYS">
          <edc:SFRModeList>
            <edc:SFRMode edc:id="DS.0" ltx:memberofperipheral="EVSYS">
              <edc:SFRFieldDef edc:cname="SYNCUSER0" edc:desc="Synchronous User Ch 0 Input Selection - TCA0" edc:nzwidth="0x8">
                <edc:SFRFieldSemantic edc:cname="OFF" edc:desc="Off" edc:when="(field &amp; 0xFF) == 0x00"/>
                <edc:SFRFieldSemantic edc:cname="SYNCCH0" edc:desc="Synchronous Event Channel 0" edc:when="(field &amp; 0xFF) == 0x01"/>
                <edc:SFRFieldSemantic edc:cname="SYNCCH1" edc:desc="Synchronous Event Channel 1" edc:when="(field &amp; 0xFF) == 0x02"/>
              </edc:SFRFieldDef>
            </edc:SFRMode>
          </edc:SFRModeList>
        </edc:SFRDef>
        <edc:SFRDef edc:_addr="0x1A3" edc:access="nnnnnnnn" edc:cname="SYNCUSER1" edc:mclr="00000000" edc:nzwidth="0x8" edc:por="00000000" ltx:memberofperipheral="EVSYS">
          <edc:SFRModeList>
            <edc:SFRMode edc:id="DS.0" ltx:memberofperipheral="EVSYS">
              <edc:SFRFieldDef edc:cname="SYNCUSER1" edc:desc="Synchronous User Ch 1 Input Selection - USART0" edc:nzwidth="0x8">
                <edc:SFRFieldSemantic edc:cname="OFF" edc:desc="Off" edc:when="(field &amp; 0xFF) == 0x00"/>
                <edc:SFRFieldSemantic edc:cname="SYNCCH0" edc:desc="Synchronous Event Channel 0" edc:when="(field &amp; 0xFF) == 0x01"/>
                <edc:SFRFieldSemantic edc:cname="SYNCCH1" edc:desc="Synchronous Event Channel 1" edc:when="(field &amp; 0xFF) == 0x02"/>
              </edc:SFRFieldDef>
            </edc:SFRMode>
          </edc:SFRModeList>
        </edc:SFRDef>
